In [1]:
import pandas as pd
import numpy as np

In [2]:
SeriesA = pd.Series([1,2,3,4,5])

In [3]:
SeriesA

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
SeriesA = pd.Series([5,4,3,2,1],index=['a' ,'b','c','d','e'])

In [6]:
SeriesA

a    5
b    4
c    3
d    2
e    1
dtype: int64

In [7]:
SeriesB = pd.Series([9,8,7,6,5], index=['a','b','c','d','f'])

In [8]:
SeriesB

a    9
b    8
c    7
d    6
f    5
dtype: int64

In [9]:
DictA = {'SeriesA':SeriesA, 'SeriesB':SeriesB}

In [10]:
DictA

{'SeriesA': a    5
 b    4
 c    3
 d    2
 e    1
 dtype: int64,
 'SeriesB': a    9
 b    8
 c    7
 d    6
 f    5
 dtype: int64}

In [20]:
dfA = pd.DataFrame(SeriesA)

In [19]:
dfA

   0
a  9
b  8
c  7
d  6
f  5

In [21]:
dfB = pd.DataFrame(SeriesB)

In [22]:
dfB

   0
a  9
b  8
c  7
d  6
f  5

In [24]:
dfDict = pd.DataFrame(DictA)

In [25]:
dfDict

   SeriesA  SeriesB
a      5.0      9.0
b      4.0      8.0
c      3.0      7.0
d      2.0      6.0
e      1.0      NaN
f      NaN      5.0

In [26]:
excel_file = "Pandas_Workbook.xlsx"

In [28]:
dfExcel = pd.read_excel(excel_file)

In [29]:
dfExcel

    Age      Name     Occupation  Identifier
0    25      Adam     Programmer        True
1    26      Beth      Scientist       False
2    24     Cindy  Manufacturing        True
3    27   Derrick        Barista        True
4    28      Evan        Analyst       False
5    26  Fredrick      Scientist        True
6    29  Gretrude     Programmer        True
7    27    Harald      Scientist       False
8    30  Isabella       Military        True
9    28       Jen        Analyst        True
10   31     Kevin  Manufacturing        True
11   29   Lindsay      Scientist       False
12   32    Monroe         Postal        True
13   30     Nevel        Analyst        True
14   21     Oscar     Programmer        True
15   33   Patrick        Fianace       False

In [30]:
dfExcel.head()

   Age     Name     Occupation  Identifier
0   25     Adam     Programmer        True
1   26     Beth      Scientist       False
2   24    Cindy  Manufacturing        True
3   27  Derrick        Barista        True
4   28     Evan        Analyst       False

In [32]:
dfExcel.head(10)

   Age      Name     Occupation  Identifier
0   25      Adam     Programmer        True
1   26      Beth      Scientist       False
2   24     Cindy  Manufacturing        True
3   27   Derrick        Barista        True
4   28      Evan        Analyst       False
5   26  Fredrick      Scientist        True
6   29  Gretrude     Programmer        True
7   27    Harald      Scientist       False
8   30  Isabella       Military        True
9   28       Jen        Analyst        True

In [33]:
dfExcel.tail()

    Age     Name  Occupation  Identifier
11   29  Lindsay   Scientist       False
12   32   Monroe      Postal        True
13   30    Nevel     Analyst        True
14   21    Oscar  Programmer        True
15   33  Patrick     Fianace       False

In [34]:
dfExcel.index

RangeIndex(start=0, stop=16, step=1)

In [36]:
print(dfExcel.dtypes)

Age            int64
Name          object
Occupation    object
Identifier      bool
dtype: object

In [39]:
names = dfExcel['Name']

In [41]:
names[0]

'Adam'

In [42]:
dfExcel.at[0,'Name']

'Adam'

In [45]:
#making names the index
df2 = pd.read_excel(excel_file, index_col='Name')

In [46]:
df2

          Age     Occupation  Identifier
Name
Adam       25     Programmer        True
Beth       26      Scientist       False
Cindy      24  Manufacturing        True
Derrick    27        Barista        True
Evan       28        Analyst       False
Fredrick   26      Scientist        True
Gretrude   29     Programmer        True
Harald     27      Scientist       False
Isabella   30       Military        True
Jen        28        Analyst        True
Kevin      31  Manufacturing        True
Lindsay    29      Scientist       False
Monroe     32         Postal        True
Nevel      30        Analyst        True
Oscar      21     Programmer        True
Patrick    33        Fianace       False

In [47]:
df2.at['Beth','Occupation']

'Scientist'

In [48]:
df2.iat[1,1]

'Scientist'

In [50]:
dfExcel.loc[[0,2,4,6], "Age":"Occupation"]

   Age      Name     Occupation
0   25      Adam     Programmer
2   24     Cindy  Manufacturing
4   28      Evan        Analyst
6   29  Gretrude     Programmer

In [53]:
dfExcel.loc[dfExcel['Identifier']==True]

    Age      Name     Occupation  Identifier
0    25      Adam     Programmer        True
2    24     Cindy  Manufacturing        True
3    27   Derrick        Barista        True
5    26  Fredrick      Scientist        True
6    29  Gretrude     Programmer        True
8    30  Isabella       Military        True
9    28       Jen        Analyst        True
10   31     Kevin  Manufacturing        True
12   32    Monroe         Postal        True
13   30     Nevel        Analyst        True
14   21     Oscar     Programmer        True

In [55]:
dfExcel.iloc[0:5:1, 0:1]

   Age
0   25
1   26
2   24
3   27
4   28